import { Component, OnInit } from '@angular/core';
export interface Relstatus {
  value: string;
  viewValue: string;
}
@Component({
  selector: 'app-relative',
  templateUrl: './relative.component.html',
  styleUrls: ['./relative.component.css']
})
export class RelativeComponent implements OnInit {
  relstatuss: Relstatus[] = [
        {value: 'rel01', viewValue: 'พี่'},
        {value: 'rel02', viewValue: 'น้อง'},
        {value: 'rel03', viewValue: 'บุตร'}
      ];


   provinces: string[] = [
       'กรุงเทพมหานคร','กระบี่','กาฬสินธุ์','กำแพงเพชร', 'ขอนแก่น', 'จันทบุรี', 'ฉะเชิงเทรา', 'ชลบุรี',
       'ชัยนาท','ชัยภูมิ','ชุมพร', 'เชียงราย', 'เชียงใหม่', 'ตรัง', 'ตราด', 'ตาก', 'นครนายก',
       'นครปฐม','นครราชสีมา', 'นครศรีธรรมราช', 'นครสวรรค์', 'นนทบุรี', 'นราธิวาส', 'น่าน',
       'บึกกาฬ','บุรีรัมย์','ปทุมธานี','ประจวบคีรีขันธ์', 'ปราจีนบุรี', 'ปัตตานี', 'พระนครศรีอยุธยา',
       'พังงา', 'พัทลุง', 'พิจิตร', 'พิษณุโลก', 'เพชรบุรี', 'เพชรบูรณ์', 'แพร่',
       'พะเยา', 'ภูเก็ต', 'มหาสารคาม', 'มุกดาหาร', 'แม่ฮ่องสอน', 'ยะลา', 'ยโสธร',
       'ร้อยเอ็ด', 'ระนอง', 'ราชบุรี', 'ลพบุรี', 'ลำปาง', 'ลำพูน', 'เลย', 'ศรีสะเกษ', 'สกลนคร', 'สงขรา',
       'สตูล', 'สมุทรปราการ', 'สมุทรสงคราม', 'สระแก้ว', 'สระบุรี', 'สิงห์บุรี', 'สุโขทัย', 'สุพรรณบุรี',
       'สุราษฎร์ธานี', 'สุรินทร์', 'หนองคาย', 'หนองบัวลำภู', 'อ่างทอง', 'อุดรธานี', 'อุทัยธานี', 'อุตรดิตถ์',
       'อุบลราชธานี', 'อำนาจเจริญ'
     ];
  constructor() { }

  ngOnInit() {
  }

}

